describe('Возведение в степень', () => {
    it('Проверка 2^3 === 8', () => {
        assert.equal(pow(2, 3), 8)
    });
    it('Проверка 2^5 === 32', () => {
        assert.equal(pow(2, 5), 32)
    });
    it('Проверка 3^3 === 27', () => {
        assert.equal(pow(3, 3), 27)
    })
});
describe('Проверка на нестандартные ситуации', () => {
    it('Проверка на отрицательные значения', () => {
        assert(pow(-3, 3) === null);
        assert(pow(3, -3) === null);
        assert(pow(-3, -3) === null);
    });
    it('Проверка на дробные значения', () => {
        assert(pow(3.1, 3) === null);
        assert(pow(3, 3.1) === null);
        assert(pow(3.1, 3.1) === null);
    });
});